<?php

// ============================================ 01

// === 配列一覧　出力

$arr_01 = ["Nara", "Shiga", "Hokkaido", "Chiba"];

$idx = 0;
$arr_01_max = count($arr_01); // 配列の長さ取得

foreach ($arr_01 as $a_01) {

    // === 配列の 長さと同じじゃなかったら、改行コードを付ける   
    if ($idx != $arr_01_max - 1) {
        print($a_01 . "\n");
    } else {
        print($a_01);
    }

    $idx++;
}


// ============================================ 02

/*

入力例1
input

出力例1
i
n
p
u
t

*/

$str_02 = fgets(STDIN);

$arr_02 = str_split($str_02); // 文字列を１文字ずつ配列へ入れる。

foreach ($arr_02 as $a_02) {
    print($a_02 . "\n");
}

// ============================================ 03

// 1行目の文字が、2行目の文字列の中に何個出現するかをカウントして出力

/*

入力例1
A
abdeeAAbAAAbfde

出力例1
5

入力例2
1
abc123

出力例2
1

*/

$t_03 = trim(fgets(STDIN)); // === ターゲット文字
$str_03 = trim(fgets(STDIN)); // === 文字列

$arr_03 = str_split($str_03); // １文字ずつ配列へ入れる
$idx_03 = 0;

foreach ($arr_03 as $val_03) {
    if ($val_03 === $t_03) {
        $idx_03 += 1;
    }
}

print($idx_03);

// ============================================ 04

// 文字列が入力されるので、その長さを出力

/*

入力例1
input

出力例1
5

入力例2
abc123

出力例2
6

*/

$str_04 = fgets(STDIN);

print(mb_strlen($str_04, "UTF-8")); // mb_strlen 文字列　長さ　出力

print(mb_strlen($str_04, "UTF-8") - 1); // mb_strlen 文字列　長さ　出力


// ============================================ 05

// 文字列が入力されるので、1文字目を出力

/*

入力例1
read

出力例1
r

*/

$str_04 = fgets(STDIN);

$tmp_04 = substr($str_04, 0, 1);

print($tmp_04);

// ============================================ 06

// 文字列が入力されるので、それらの文字を、1文字ずつ出力

/*

入力例1
read

出力例1
r
e
a
d

*/

$str_05 = fgets(STDIN);

$arr_05 = str_split($str_05);

foreach ($arr_05 as $a_5) {
    print($a_5 . "\n");
}

// ============================================ 07

// 文字列 s が入力されるので、1文字目と2文字目を出力

/*

入力例1
read

出力例1
r e

入力例2
scale

出力例2
s c

*/

$str_06 = fgets(STDIN);

$arr_06 = str_split($str_06);

print($arr_06[0] . " " . $arr_06[1]);


// ============================================ 08

// 文字列 s が入力されるので、n 文字目と n + 1 文字目を出力してください。 
// n + 1 文字目がない場合は何も出力

/*

入力例1
2
read

出力例1
e a

*/

$num_07 = fgets(STDIN);
$str_07_t = fgets(STDIN);

$arr_07 = str_split($str_07_t);


