<?php

// ============================================ 01 

// === 2次元配列の要素を全て　出力

$arr_001_a = [1, 2, 3, 4, 5, 6];
$arr_001_b = [8, 1, 3, 3, 1, 8];

// 1次元配列から、2次元配列を作成
$arr_01 = array($arr_001_a, $arr_001_b);

$ans = 0;
for ($i = 0; $i < count($arr_01); $i++) {
    for ($j = 0; $j < count($arr_01[$i]); $j++) {
        #  print($arr_01[$i][$j]);
        $ans++;
    }
}

print($ans);


// ============================================ 02

$arr_002_a = [6, 5, 4, 3, 2, 1];
$arr_002_b = [3, 1, 8, 8, 1, 3];

$arr_02 = array($arr_002_a, $arr_002_b);

for ($i = 0; $i < count($arr_02); $i++) {
    for ($j = 0; $j < count($arr_02[$i]); $j++) {
        if ($j === count($arr_02[$i]) - 1) {
            print($arr_02[$i][$j] . "\n");
        } else {
            print($arr_02[$i][$j] . " ");
        }
    }
}


// ============================================ 03

/*

以下の二次元配列を宣言し、この配列の行数を出力してください。

1 2 3
4 5 6
8 1 3

*/

$arr_03_a = [1, 2, 3];
$arr_03_b = [4, 5, 6];
$arr_03_c = [8, 1, 3];

$arr_03 = array($arr_03_a, $arr_03_b, $arr_03_c);

// ============================================ 04

/*

以下の二次元配列を宣言し、この配列の行数を出力

*/

$arr_03_a = [1, 2, 3];
$arr_03_b = [4, 5, 6];
$arr_03_c = [8, 1, 3];

$arr_03 = array($arr_03_a, $arr_03_b, $arr_03_c);

print(count($arr_03));


// ============================================ 05

/*

以下の二次元配列を宣言し、この配列の列数を出力

1 2 3 4
6 5 4 3
3 1 8 1

*/

$arr_04_a = [1, 2, 3, 4];
$arr_04_b = [6, 5, 4, 3];
$arr_04_c = [3, 1, 8, 1];

$arr_04 = array($arr_04_a, $arr_04_b, $arr_04_c);

$num_04 = 0;

# print($arr_04[2][0]);

for ($i = 0; $i < count($arr_04); $i++) {
    for ($j = 0; $j < count($arr_04[$i]); $j++) {
        $arr_04[$i][$j];
        $num_04 += 1;
    }
}

// === 全体　割る　行数で、1列分の要素を出力
print($num_04 / count($arr_04));


// ============================================ 06

// 以下の二次元配列を宣言し、この配列の各行の要素数を改行区切りで出力

/*

1
2 3
4 5 6

*/

$arr_05_a = [1];
$arr_05_b = [2, 3];
$arr_05_c = [4, 5, 6];

$arr_05 = array($arr_05_a, $arr_05_b, $arr_05_c);

for ($i = 0; $i < count($arr_05); $i++) {
    print($i + 1);
    for ($j = 0; $j < count($arr_05[$i]); $j++) {
    }
}


// ============================================ 07

# 2次元配列　値　取得

# === 全出力

$num_06 = fgets(STDIN);

$arr_06 = [];

for ($i = 0; $i <= $num_06; $i++) {
    $arr_06[$i] = explode(" ", fgets(STDIN));

    for ($j = 0; $j < count($arr_06[$i]); $j++) {
        if ($j === count($arr_06[$i]) - 1) {
            print($arr_06[$i][$j]);
        } else {
            print($arr_06[$i][$j] . " ");
        }
    }
}
